// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length>=3){
    console.log('великий масив');
} else if (friends.length<3){
        console.log('маленький масив');
    } else{
        console.log('error');
    }

//
//
//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.




//
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let a = 10;
let b = 20;
let result=a+b<4?console.log('malo'):console.log('bagato')


//
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let x = 99;
let result2 = x>-100&&x<0?console.log('negative'):x===0?console.log('0'):x>0&&x<100?console.log('positive'):console.log('error')
//
//
//
//
//
//
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = true;
let result3 = test ? console.log('вірно') : console.log('неправильно');

if (test){
    console.log('вірно');

}else{
    console.log('неправильно');
}

//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let name = prompt('яка офіційна назва JavaScript?');
if (name==="ECMAScript"){
    console.log('правильно');
}else{
    console.log('Ну знаєте?ECMAScript');
}


//
//
//
//
//
//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let flat = 69;
if(flat>=1&&flat<=20){
    console.log('build1');
}else if(flat>20&&flat<=48){
    console.log('build2');

}else if (flat>=49&&flat<=90){
    console.log('build3');
}else{
    console.log('error');

}
//
//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
let number = 10;
let result5 = number === 10?console.log('вірно'): console.log('невірно')
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temperature = 15;
if (temperature>10&&temperature<22){
    console.log('go to study');
}else{
    console.log('stay at home and study on-line');
}

//
//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let game = 10;
switch (game){
    case 1:
        console.log('car');
        break;
    case 2:
        console.log('bike');
        break;
    case 3:
        console.log('phone');
        break;
    case 4:
        console.log('book');
        break;
    case 5:
        console.log('pen');
        break;
    default:
        console.log('you lose');
}